Revit 2027 API
BuiltInFailures.AssemblyFailures.AssemblyDidNotMatchRequestedTypeWarn Property
 Assembly was changed to a new type, but did not match the type. Geometry could have been changed due to a join condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AssemblyDidNotMatchRequestedTypeWarn { get; }
Public Shared ReadOnly Property AssemblyDidNotMatchRequestedTypeWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AssemblyDidNotMatchRequestedTypeWarn {
	FailureDefinitionId^ get ();
}
static member AssemblyDidNotMatchRequestedTypeWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace